import React from 'react';

export const US_RI = (color) =>{
    const style = {
        fill : color,
    }
    return(
        <div style = {style}>
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 12.63 17.24">
                <defs>
                </defs>
                <g id="Слой_2" data-name="Слой 2">
                    <g id="Слой_1-2" data-name="Слой 1">
                        <path id="US-RI" className="cls-1"
                              d="M11.19,6.29,10.74,7l-.87-.65L9.3,5.53l-.6-.39-.55-.06L9.13,7l-.6,1.77.79,3.93-.83,2-3.7,2.12L3.58,17l-.13-1.28L3.72,15l-.28-1.36-.18-.89-.42-1.48L2.37,9.62,1.86,7.79,1.41,6.17,1.08,5,.63,3.39.31,2.24l1.2-.35,1.64-.48L4.73,1l1-.29L6.91.31l.32,1,.49,1.47.73,0L8.76,4l.2.81.72.34.73.35Zm1.17,4.63-.63.81-.92.15L11,11l-.15-1.21L11,8.35l.14-.46.42-.49Zm-2,.7-.34.52-.45-1,0-1.28.31-.11.33.59Z"/>
                    </g>
                </g>
            </svg>
        </div>
    );
}